Model lift is a way of measuring performace of classification models that is easy to interpret than using scientific measurements such as ROC & AUC. Even more,

### Converting CSV files to MySQL DB

In [10]:
#importing dependencies
import os
import sys
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from sqlalchemy.exc import SQLAlchemyError
from sqlalchemy.orm import sessionmaker
import seaborn as sns
import matplotlib.pyplot as plt
import mysql.connector as msql
from mysql.connector import Error
import csv
import pymysql

In [2]:
#reading in the csv files
users = pd.read_csv('Users.csv')
search = pd.read_csv('SearchPage.csv')
paypage = pd.read_csv('PaymentPage.csv')
payconf = pd.read_csv('PaymentConfirmation.csv')
home = pd.read_csv('HomePage.csv')

In [3]:
#creating insider db
import mysql.connector as msql
from mysql.connector import Error
try:
    conn = msql.connect(host='localhost',
                        user='root',
                        password ='Brookline31!',
                        database = 'insider',
                        auth_plugin='mysql_native_password')
    if conn.is_connected():
        cursor = conn.cursor()
        cursor.execute("CREATE DATABASE insider")
        print("insider database is created")
except Error as e:
    print("Error while connecting to MySQL", e)

Error while connecting to MySQL 1007 (HY000): Can't create database 'insider'; database exists

In [4]:
# import the module
from sqlalchemy import create_engine
# create sqlalchemy engine
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"  
                      .format(user="root", pw="Brookline31!", 
                      db='insider'))

In [5]:
#injesting csv files to db
users.to_sql('Users', con = engine, if_exists = 'append', chunksize = 1000, index = False)
search.to_sql('Search_Page', con = engine, if_exists = 'append', chunksize = 1000, index = False)
paypage.to_sql('Payment_Page', con = engine, if_exists = 'append', chunksize = 1000, index = False)
payconf.to_sql('Payment_Confirmation', con = engine, if_exists = 'append', chunksize = 1000, index = False)
home.to_sql('HomePage', con = engine, if_exists = 'append', chunksize = 1000, index = False)

### Initial Data Exploration/Table Joining

In [21]:
pd.read_sql_table('Users', engine)

        user_id        date   device     sex
0        450007  2015-02-28  Desktop  Female
1        756838  2015-01-13  Desktop    Male
2        568983  2015-04-09  Desktop    Male
3        190794  2015-02-18  Desktop  Female
4        537909  2015-01-15  Desktop    Male
...         ...         ...      ...     ...
180795   307667  2015-03-30  Desktop  Female
180796   642989  2015-02-08  Desktop  Female
180797   659645  2015-04-13  Desktop    Male
180798   359779  2015-03-23  Desktop    Male
180799   438929  2015-03-26   Mobile  Female

[180800 rows x 4 columns]

In [23]:
pd.read_sql_table('Payment_Confirmation', engine)

     user_id                       page
0     123100  payment_confirmation_page
1     704999  payment_confirmation_page
2     407188  payment_confirmation_page
3     538348  payment_confirmation_page
4     841681  payment_confirmation_page
..       ...                        ...
447   397473  payment_confirmation_page
448   860829  payment_confirmation_page
449   371291  payment_confirmation_page
450   263707  payment_confirmation_page
451   892101  payment_confirmation_page

[452 rows x 2 columns]

In [30]:
pd.read_sql('SELECT sum(sex) FROM Users', engine)

   sum(sex)
0       0.0

In [36]:
pd.read_sql('SELECT count(*) FROM Users WHERE sex = "Male"', engine)

   count(*)
0     90650

In [37]:
pd.read_sql('SELECT count(*) FROM Users WHERE sex = "Female"', engine)

   count(*)
0     90150

In [38]:
pd.read_sql('SELECT count(*) FROM Users WHERE device = "Desktop"', engine)

   count(*)
0    120400

In [39]:
pd.read_sql('SELECT count(*) FROM Users WHERE device = "Mobile"', engine)

   count(*)
0     60400

In [41]:
pd.read_sql('SELECT * FROM Users JOIN HomePage on Users.user_id = HomePage.user_id', engine)

        user_id        date   device     sex  user_id       page
0        159517  2015-03-25  Desktop    Male   159517  home_page
1        639988  2015-04-03  Desktop  Female   639988  home_page
2        606959  2015-02-21  Desktop  Female   606959  home_page
3        886066  2015-01-10  Desktop    Male   886066  home_page
4        429473  2015-02-28   Mobile  Female   429473  home_page
...         ...         ...      ...     ...      ...        ...
180795   910737  2015-03-23   Mobile    Male   910737  home_page
180796   622751  2015-04-30   Mobile  Female   622751  home_page
180797   734295  2015-01-18  Desktop  Female   734295  home_page
180798   573618  2015-01-19   Mobile  Female   573618  home_page
180799   287951  2015-03-29  Desktop    Male   287951  home_page

[180800 rows x 6 columns]

In [42]:
pd.read_sql('SELECT * FROM Users JOIN Search_Page on Users.user_id = Search_Page.user_id', engine)

       user_id        date   device     sex  user_id         page
0       838832  2015-03-08  Desktop  Female   838832  search_page
1       429473  2015-02-28   Mobile  Female   429473  search_page
2       457209  2015-01-07  Desktop  Female   457209  search_page
3       821176  2015-01-30  Desktop  Female   821176  search_page
4        26481  2015-03-14  Desktop  Female    26481  search_page
...        ...         ...      ...     ...      ...          ...
90395   974762  2015-04-11  Desktop    Male   974762  search_page
90396   910737  2015-03-23   Mobile    Male   910737  search_page
90397   934340  2015-04-26  Desktop  Female   934340  search_page
90398   528989  2015-02-28   Mobile    Male   528989  search_page
90399   573618  2015-01-19   Mobile  Female   573618  search_page

[90400 rows x 6 columns]

In [43]:
pd.read_sql('SELECT * FROM Users JOIN Payment_Page on Users.user_id = Payment_Page.user_id', engine)

       user_id        date   device     sex  user_id          page
0       231324  2015-02-22  Desktop  Female   231324  payment_page
1       999441  2015-02-06   Mobile    Male   999441  payment_page
2       635882  2015-02-22  Desktop  Female   635882  payment_page
3       126569  2015-02-24  Desktop    Male   126569  payment_page
4       430295  2015-01-21   Mobile    Male   430295  payment_page
...        ...         ...      ...     ...      ...           ...
12055    95652  2015-01-04   Mobile  Female    95652  payment_page
12056    71542  2015-01-25  Desktop    Male    71542  payment_page
12057   260531  2015-01-05  Desktop  Female   260531  payment_page
12058   182714  2015-01-13  Desktop  Female   182714  payment_page
12059   492404  2015-02-27  Desktop    Male   492404  payment_page

[12060 rows x 6 columns]

In [67]:
visit = pd.read_sql('SELECT Users.user_id, Users.date, Users.device, Users.sex FROM Users JOIN HomePage on Users.user_id = HomePage.user_id', engine)
searched = pd.read_sql('SELECT Users.user_id, Users.date, Users.device, Users.sex FROM Users JOIN Search_Page on Users.user_id = Search_Page.user_id', engine)
basket = pd.read_sql('SELECT Users.user_id, Users.date, Users.device, Users.sex FROM Users JOIN Payment_Page on Users.user_id = Payment_Page.user_id', engine)
sales = pd.read_sql('SELECT Users.user_id, Users.date, Users.device, Users.sex FROM Users JOIN Payment_Confirmation on Users.user_id = Payment_Confirmation.user_id', engine)

In [75]:
visit.groupby(['device','sex']).count()

                user_id   date
device  sex
Desktop Female    59994  59994
        Male      60406  60406
Mobile  Female    30156  30156
        Male      30244  30244

In [76]:
searched.groupby(['device','sex']).count()

                user_id   date
device  sex
Desktop Female    30182  30182
        Male      30018  30018
Mobile  Female    15170  15170
        Male      15030  15030

In [77]:
basket.groupby(['device','sex']).count()

                user_id  date
device  sex
Desktop Female     3060  3060
        Male       2960  2960
Mobile  Female     3140  3140
        Male       2900  2900

In [78]:
sales.groupby(['device','sex']).count()

                user_id  date
device  sex
Desktop Female      148   148
        Male        152   152
Mobile  Female      334   334
        Male        270   270

In [79]:
pd.read_sql('SELECT Users.user_id, Users.date, Users.device, Users.sex FROM Users JOIN HomePage on Users.user_id = HomePage.user_id JOIN Search_Page on Users.user_id = Search_Page.user_id JOIN Payment_Page on Users.user_id = Payment_Page.user_id JOIN Payment_Confirmation on Users.user_id = Payment_Confirmation.user_id' , engine)

     user_id        date   device     sex
0      13830  2015-02-05  Desktop    Male
1     559850  2015-02-11   Mobile  Female
2     638114  2015-01-09   Mobile  Female
3     581956  2015-02-25   Mobile    Male
4     337704  2015-01-31  Desktop    Male
..       ...         ...      ...     ...
899    30217  2015-02-11   Mobile    Male
900   869943  2015-02-15   Mobile    Male
901   370509  2015-01-18  Desktop    Male
902   528989  2015-02-28   Mobile    Male
903   377893  2015-02-09  Desktop    Male

[904 rows x 4 columns]

In [80]:
pd.read_sql('SELECT Users.user_id, Users.date, Users.device, Users.sex, HomePage.page as Home_Page FROM Users LEFT JOIN HomePage on Users.user_id = HomePage.user_id', engine)

        user_id        date   device     sex  Home_Page
0        159517  2015-03-25  Desktop    Male  home_page
1        639988  2015-04-03  Desktop  Female  home_page
2        606959  2015-02-21  Desktop  Female  home_page
3        886066  2015-01-10  Desktop    Male  home_page
4        429473  2015-02-28   Mobile  Female  home_page
...         ...         ...      ...     ...        ...
180795   910737  2015-03-23   Mobile    Male  home_page
180796   622751  2015-04-30   Mobile  Female  home_page
180797   734295  2015-01-18  Desktop  Female  home_page
180798   573618  2015-01-19   Mobile  Female  home_page
180799   287951  2015-03-29  Desktop    Male  home_page

[180800 rows x 5 columns]